from pathlib import Path
from reportlab.lib.pagesizes import A4
from reportlab.lib.units import mm

# =========================================================
# 字体目录
# =========================================================
FONT_DIR = Path(
    r"FONTS"
)

# =========================================================
# 输出目录
# =========================================================
OUTPUT_DIR = Path("output")

# =========================================================
# UI字体
# =========================================================
UI_FONT_PATH = r"C:\Windows\Fonts\simkai.ttf"

# =========================================================
# 页面参数
# =========================================================
PAGE_WIDTH, PAGE_HEIGHT = A4

MARGIN = 15 * mm

GRID_SIZE = 14 * mm

COLS = int((PAGE_WIDTH - 2 * MARGIN) // GRID_SIZE)

MAX_ROWS_PER_PAGE = int(
    (PAGE_HEIGHT - 2 * MARGIN) // GRID_SIZE
)

FONT_SIZE = GRID_SIZE * 0.90

OFFSET_X = 0
OFFSET_Y = 0
TEXT_OFFSET = 0

# =========================================================
# 透明度控制
# =========================================================

# 外框
ALPHA_BORDER = 1.0

# 米字格辅助线
ALPHA_GRID = 0.30

# 示例字
ALPHA_DEMO_TEXT = 1.0

# 字体备注
ALPHA_FONT_NOTE = 0.60

# 页眉
ALPHA_HEADER = 1.0

# 页脚
ALPHA_FOOTER = 1.0

# =========================================================
# 字体优先级
# =========================================================
# =========================================================
# 基础标准楷书（主练）
# =========================================================
MAIN_KAISHU = [

    "田英章硬笔楷书简体.ttf",
    "卢中南硬笔楷书简体.TTF",
    "荆霄鹏楷书.TTF",
    "司马彦楷书简体.TTF",

    "姜浩硬笔楷书.TTF",
    "方正硬笔楷书简体.ttf",
    "林志秀硬笔楷书修订版.TTF",

    # "薛文轩钢笔楷体.TTF",
    # "庞中华钢笔楷书.TTF",

    "丁永康硬笔楷书.TTF",
    "瑞美加张清平硬笔楷书.TTF",

    "全新硬笔楷书简.ttf",
    "方正字迹-张颢硬笔楷书.ttf",

    # "王正良硬笔楷书立体简.TTF",

]

# =========================================================
# 毛笔楷书（结构训练）
# =========================================================
MAOBI_KAISHU = [

    "颜真卿颜体.ttf",
    "柳公权柳体.ttf",

    "方正褚遂良楷书 简FZChuSLKSJW.TTF",

    "方正赵孟頫楷书 简FZZhaoMFKSJW.TTF",

    "卢中南毛笔小楷.ttf",
    "方正欧阳询楷书 简FZOuYXKSJW.TTF",
    "方正虞世南楷书 简FZYuShiNanKaiSJ.TTF",
    "方正钟繇小楷 简FZZhongYXKJ.TTF",
    "方正灵飞经小楷 简FZLingFJXKJW.TTF",
    "方正文征明小楷 简FZWenZMXKJW.TTF",
]

# =========================================================
# 行楷 / 行书
# =========================================================
RUNNING_SCRIPT = [

    "吴玉生行楷.TTF",
    "吴玉生硬笔行书.ttf",

    "田英章硬笔行书简体.TTF",

    "荆霄鹏行楷.TTF",

    "方正硬笔行书简体.TTF",

    "书体坊赵孟頫行楷 简STFZhaoMFXKJW.TTF",

    "方正赵孟頫行书 简FZZhaoMFXSJW.TTF",

]

# =========================================================
# 个性 / 艺术字体
# =========================================================
STYLE_FONTS = [

    "启功字体简体.TTF",
    "启功字体繁体.TTF",

    "徐静蕾字体.TTF",

    "品如手写体.TTF",

]

# =========================================================
# 基础 fallback
# =========================================================
FALLBACK_FONTS = [

    "楷体_GB2312.ttf",

    "仿宋_GB2312.ttf",

    "黑体.ttf",

    # "宋体.ttc",

    "方正小标宋简体.TTF",

]

# =========================================================
# 最终优先级
# =========================================================
FONT_PRIORITY = (

    FALLBACK_FONTS

    + MAIN_KAISHU

    + MAOBI_KAISHU

    + RUNNING_SCRIPT

    + STYLE_FONTS

)